app/controllers/cores_controller.rb

SELECT COUNT(*) FROM "cores"
---
  def search
    @cores_count = Core.count