app/controllers/staffers_controller.rb

  def index
    if choice_hash = get_selected_status_staffer
      clean_choice_hash = {}
      @view_mode = choice_hash[:view_mode]

      choice_hash.each do |key, value|
        clean_choice_hash[key] = value if !value.nil? && value != "" && key != :view_mode
      end
      @selected_data = Staffer.where(clean_choice_hash)
    else # choice_hash is nil
      @selected_data = Staffer.all.order(updated_at: :desc)
    end

    if url = params[:url]
      @selected_data = @selected_data.where(domain: url).order(updated_at: :desc)
    else
      @selected_data = @selected_data.order(updated_at: :desc)
    end
    @staffer_count = Staffer.count
    @selected_staffer_count = @selected_data.count

    # CSV #
    respond_to do |format|
      format.html
      format.csv { render text: @selected_data.to_csv }
    end

    @staffers = @selected_data.filter(filtering_params(params)).paginate(:page => params[:page], :per_page => 40)
---
SELECT COUNT(*) FROM "staffers"
SELECT  "staffers".* FROM "staffers" ORDER BY "staffers"."updated_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 40], ["OFFSET", 0]]

  def search
    @staffer_count = Staffer.count
---
SELECT COUNT(*) FROM "staffers"